{



"wab": [

  {
    "title": "Joint Calibrationless Reconstruction and Segmentation of Parallel MRI",
    "authors": "Aniket Pramanik, Mathews Jacob",
    "journal": "2022 ECCV Medical Computer Vision Workshop (ECCV-MCV 2022)",
    "abstract": "The volume estimation of brain regions from MRI data is a key problem in many
     clinical applications, where the acquisition of data at high spatial resolution is desirable.
     While parallel MRI and constrained image reconstruction algorithms can accelerate the scans,
     image reconstruction artifacts are inevitable, especially at high acceleration factors.
     We introduce a novel image domain deep-learning framework for calibrationless parallel MRI
     reconstruction, coupled with a segmentation network to improve image quality and to reduce
     the vulnerability of current segmentation algorithms to image artifacts resulting from
     acceleration. The combination of the proposed image domain deep calibrationless approach
     with the segmentation algorithm offers improved image quality, while increasing the accuracy
     of the segmentations. The novel architecture with an encoder shared between the reconstruction
     and segmentation tasks is seen to reduce the need for segmented training datasets.
     In particular, the proposed few-shot training strategy requires only 10% of segmented
     datasets to offer good performance.",
    "bib": "@article{pramanik2021joint, <br>
      title={Joint calibrationless reconstruction and segmentation of parallel MRI}, <br>
      author={Pramanik, Aniket and Wu, Xiaodong and Jacob, Mathews}, <br>
      journal={arXiv preprint arXiv:2105.09220}, <br>
      year={2021} <br>
      }",
    "jbox": "ECCV",
    "arxiv_link": "https://arxiv.org/abs/2105.09220",
    "slides": " ",
    "code": " ",
    "date": "2022-10-01"

  },


  {
    "title": "Multimodal Super Resolution with Dual Domain Loss and Gradient Guidance",
    "authors": "Anitha Priya Krishnan, Roshan Reddy, Aniket Pramanik, Zhuang Song, Richard A.D. Carano" ,
    "journal": "2022 MICCAI International Workshop on Simulation and Synthesis in Medical Imaging (SASHIMI 2022)",
    "abstract": "Spatial resolution plays a crucial role in quantitative assessment of various
     structures in brain MRI. Super resolution (SR) as a post-processing tool holds promise for
     restoring the high frequency details lost in a low resolution (LR) acquisition with no additional
     scan time. Prior multicontrast deep learning SR approaches are mostly in 2D and operate in a
     pre-upsampling or progressive setting. Here we propose an efficient shallow 3D projection based
     post-upsampling network for anisotropic SR of brain MRI. The network is optimized using losses
     in the spatial and frequency domains and a complementary high resolution (HR) input to inform
     SR of the low resolution (LR) input with tighter integration of features. We investigated the
     benefit of different feature aggregation strategies such as concatenation and multiplicative attention
     and gradient guidance from the HR target or the additional HR input. The models were trained and evaluated
     on diverse datasets and performed comparably with MINet, another recently developed multimodal SR model,
     with approximately half the number of model parameters. The model generalized well to an external
     test set; performed satisfactorily on acquired LR MRI volumes despite the LR input being simulated
     from HR volumes during training and resulted in lower high frequency error norm.
     From the ablation studies, we note that a multimodal network noticeably improves SR compared to a
     unimodal network and feature aggregation using concatenation and multiplicative attention
     performed equally well. We also highlight the leakage of information from the complementary
     HR input to the SR output volume and the limited value of PSNR and SSIM as evaluation metrics in such cases.",
    "bib": "@inproceedings{krishnan2022multimodal, <br>
      title={Multimodal Super Resolution with Dual Domain Loss and Gradient Guidance}, <br>
      author={Krishnan, Anitha Priya and Upendra, Roshan Reddy and Pramanik, Aniket and Song, Zhuang and Carano, Richard AD}, <br>
      booktitle={International Workshop on Simulation and Synthesis in Medical Imaging}, <br>
      pages={91--100}, <br>
      year={2022}, <br>
      organization={Springer} <br>
      }",
    "jbox": "MICCAI",
    "arxiv_link": "https://link.springer.com/chapter/10.1007/978-3-031-16980-9_9",
    "slides": " ",
    "code": " ",
    "date": "2022-08-01"

  },



  {
    "title": "Image domain Deep-SLR for Joint Reconstruction-Segmentation of Parallel MRI",
    "authors": "Aniket Pramanik, Mathews Jacob",
    "journal": "2021 The International Society for Magnetic Resonance in Medicine Annual Meeting (ISMRM 2021)",
    "abstract": "We present a novel framework for the joint reconstruction and segmentation
     of parallel MRI (PMRI) brain data. We introduce an image domain deep network for
     calibrationless recovery of undersampled PMRI data. It is deep-learning based generalization
     of local low-rank approaches for uncalibrated PMRI recovery including CLEAR.
     The image domain approach exploits additional annihilation relations compared to k-space
     based approaches and hence offers improved performance. To minimize segmentation errors
     resulting from undersampling artifacts, we combined the proposed scheme with a segmentation
     network and trained it end-to-end. It offers improved reconstruction with reduced blurring
     and sharper edges than independently trained reconstruction network." ,
    "bib": "@inproceedings{pramanikimage, <br>
      title={Image domain Deep-SLR for Joint Reconstruction-Segmentation of Parallel MRI}, <br>
      author={Pramanik, Aniket and Jacob, Mathews}, <br>
      booktitle={2021 ISMRM}, <br>
      year={2021}, <br>
      organization={ISMRM} <br>
      }",
    "jbox": "ISMRM",
    "arxiv_link": "https://archive.ismrm.org/2021/0393.html",
    "slides": " ",
    "code": " ",
    "date": "2021-04-01"

  },





  {
    "title": "Model based Deep Learning for Calibrationless Parallel MRI recovery",
    "authors": "Aniket Pramanik, Hemant Aggarwal, Mathews Jacob",
    "journal": "2020 The International Society for Magnetic Resonance in Medicine Annual Meeting (ISMRM 2020)",
    "abstract": "We introduce a fast model based deep learning approach for calibrationless parallel
     MRI reconstruction. The proposed scheme is a non-linear generalization of structured low-rank (SLR)
     methods that self learn linear annihilation filters. It pre-learns non-linear annihilation relations
     in the Fourier domain from exemplar data which significantly reduces the computational complexity,
     making it three orders of magnitude faster than SLR schemes. It allows incorporation of spatial
     domain prior that offers improved performance over calibrated image domain MoDL approach. The
     calibrationless strategy minimizes potential mismatches between calibration data and the main scan,
     while eliminating the need for a fully sampled calibration region." ,
     "bib": "@inproceedings{pramanikmodel, <br>
       title={Model based Deep Learning for Calibrationless Parallel MRI recovery}, <br>
       author={Pramanik, Aniket and Aggarwal, Hemant Kumar and Jacob, Mathews}, <br>
       booktitle={2020 ISMRM}, <br>
       year={2020}, <br>
       organization={ISMRM} <br>
       }",
    "jbox": "ISMRM",
    "arxiv_link": "https://archive.ismrm.org/2020/3436.html",
    "slides": " ",
    "code": " ",
    "date": "2020-04-01"

  }



]




}
